---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.OutlineLineWeight
source: html/da2ddbee-e3c2-ed8e-2f09-9290d08b19a6.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.OutlineLineWeight Property

Line weight of outline and fence lines in the diagram.

## Syntax (C#)
```csharp
public int OutlineLineWeight { get; set; }
```